BRBPortal_CSharp/StaticData/SaveUnit_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cityofberkeley.info/RTS/ClientPortal/API">
  <soapenv:Header/>
  <soapenv:Body>
    <api:updateUnitStatusChange>
      <unitStatusChangeReq>
        <userId>DAVE10</userId>
        <propertyId>300</propertyId>
        <unitId>824</unitId>
        <clientPortalUnitStatusCode>Rented</clientPortalUnitStatusCode>
        <unitStatus>Rented</unitStatus>
        <!--Optional:-->
        <exemptionReason></exemptionReason>
        <declarationInitial>dbb</declarationInitial>
        <questions>
          <!--Optional:-->
          <dateStarted></dateStarted>
          <!--Optional:-->
          <asOfDate>04/04/2018</asOfDate>
          <!--Optional:-->
          <occupiedBy></occupiedBy>
          <!--Optional:-->
          <contractNo></contractNo>
          <!--Optional:-->
          <commeUseDesc></commeUseDesc>
          <!--Optional:-->
          <isCommeUseZoned></isCommeUseZoned>
          <!--Optional:-->
          <isExclusivelyForCommeUse></isExclusivelyForCommeUse>
          <!--Optional:-->
          <_x0035_0PercentAsOf31Dec1979></_x0035_0PercentAsOf31Dec1979>
          <!--Optional:-->
          <ownerOccupantName></ownerOccupantName>
          <!--Zero or more repetitions:-->
          <namesOfownersOfRecord></namesOfownersOfRecord>
          <!--Optional:-->
          <nameOfPropertyManagerResiding></nameOfPropertyManagerResiding>
          <!--Optional:-->
          <emailOfPhoneOfPropertyManagerResiding></emailOfPhoneOfPropertyManagerResiding>
          <!--Optional:-->
          <IsOwnersPrinciplePlaceOfResidence></IsOwnersPrinciplePlaceOfResidence>
          <!--Optional:-->
          <doesOwnerResideInOtherUnitOfThisUnitProperty></doesOwnerResideInOtherUnitOfThisUnitProperty>
          <!--Zero or more repetitions:-->
          <tenantsAndContactInfo>
            <name></name>
            <contactInfo></contactInfo>
          </tenantsAndContactInfo>
        </questions>
      </unitStatusChangeReq>
    </api:updateUnitStatusChange>
  </soapenv:Body>
</soapenv:Envelope>